// Оголосіть змінні str, num, flag и txt зі значеннями «Привіт», 123, true, «true».
// За допомогою typeof переконайтесь, що значення змінних належать типам: string, number и  boolean.


// let str="Привіт";
// let num=123;
// let flag=true;
// let txt="true";

// console.log(typeof "Привіт");
// console.log(typeof 123);
// console.log(typeof true);
// console.log(typeof "true");


// Оголосіть змінні a1, a2, a3, a4, a5. За домогою 3х математичних оператцій отримайте числа:
//     34,
//     12,
//     66,
//     90,
//     87
//     Старайтесь використовувати різні оператори.
//     Example: 88 = (16 / 2) * 11

// let a1=17;
// let a2=6;
// let a3=10;
// let a4=9;
// let a5=2;


// console.log(a1*a5);
// console.log(a5*a2);
// console.log(a2*a3+a2);

// console.log(a4*a3);
// console.log(a1+(a3*a2)+a3);


// Створіть змінні a6, a7, a8, a9, a10. Запишіть в них результати виразів:
//     5 % 3,
//     3 % 5,
//     5 + '3',
//     '5' - 3,
//     75 + 'кг'
// let a6=2;
// let a7=3;
// let a8=53;
// let a9=2;
// let a10=75кг;


// Напишіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
//    Значееня площі зберігати в змінній s.

// let height=23;
// let width=10;
// let s=230;
// console.log(height*width);

//   Напиши код, который находит объем цилиндра высотой 10м (переменная heightC) и диаметром основания 4м (dC),
//     результат поместите в переменную v.

// let heightC=10;
// let dC=8;
// const p=3.14;
// let v=251.20;
// console.log(heightC*dC*p);



// У прямоугольного треугольника две стороны n (со значением 3) и m (со значением 4).
//    Найдите гипотенузу k по теореме Пифагора (нужно использовать функцию Math.pow(число, степень) или оператор возведения в степень ** ).

// let n=3;
// let m=4;
// let k=5;

// console.log(Math.pow(3,2)+Math.pow(4,2))


// Вывести в окно браузера при помощи метода alert() следующие данные: Ваше ФИО, возраст, хобби (каждой на новой строки спомощью \n).

// alert('Русакович І.А\n 24\n Читати книги')


// Создать 4 переменные с использованием ключевого слова let с именами str1, str2, str3, concatenation.
//   Переменной str1 присвоить фразу ‘Кто ‘, str2 – ‘ты ‘, str3 – ‘такой?’
//   Локальной переменной concatenation присвоить результат конкатенации 3-х строк: str1, str2, str3.
//   Вывести в документ содержимое переменной concatenation спомощью document.write

// let str1='Кто'
// let str2='ты'
// let str3='такой?'
// let concatenation=(str1+str2+str3)
// console.log(concatenation);
// document.write('Ктотытакой?')


// С помощью окна ввода, вызываемого методом prompt, сделать сложение двух чисел, а вывод результата при помощи метода alert

// let a3=10
// let b3=15


// prompt('','10+15');
// alert(25)


// С помощью окна ввода, вызываемого методом prompt, пользователь последовательно выводит имя, фамилию и возраст, а вам не обходимо вывести строку такого вида
//       Доброго вечера Иван Иванов, мои поздравления что вам 32 , а вывод результата при помощи метода alert

// let firstName=prompt("Введіть імя","");
// let lastName=prompt("Введіть прізвище",'')
// let years=prompt('Скільки вам років?',"")
// alert('Доброго вечора '+firstName+""+lastName+',мои поздравления что вам '+years+' років!')
